Revit 2027 API
Application.RegisterFailuresProcessor Method
 Replaces Revit's default user interface (if present) with alternative handling for all warnings and errors (including those not generated by your application) for the rest of the Revit session; if your application is not prepared to respond to all warnings and errors, consider use of IFailuresPreprocessor (in your opened Transaction) or the FailuresProcessing event instead of this interface.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void RegisterFailuresProcessor(
	IFailuresProcessor processor
)
Public Shared Sub RegisterFailuresProcessor (
	processor As IFailuresProcessor
)
public:
static void RegisterFailuresProcessor(
	IFailuresProcessor^ processor
)
static member RegisterFailuresProcessor :
        processor : IFailuresProcessor -> unit
Parameters
processor IFailuresProcessor
 Instance of Failures Processor to be used by the Revit Application.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If there is previously registered Failures Processor, it gets discarded. If you opt to register a FailuresProcessor for Revit, your processor will become the default error handler for all Revit errors for the session. The standard Revit error dialog will not appear.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace